app/controllers/books_controller.rb

  def show
    book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]