app/controllers/borrowings_controller.rb

  def create
    if @book.available
      borrowing = current_user.borrowings.create(book: @book, due_date: 2.weeks.from_now, returned: false)
      @book.update(available: false)
---
INSERT INTO "borrowings" ("user_id", "book_id", "due_date", "returned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["book_id", 1], ["due_date", "2025-02-26"], ["returned", false], ["created_at", "2025-02-12 12:48:03.115243"], ["updated_at", "2025-02-12 12:48:03.115243"]]
UPDATE "books" SET "available" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["available", false], ["updated_at", "2025-02-12 12:48:03.160045"], ["id", 1]]

  def return_book
    borrowing = current_user.borrowings.find_by(book: @book, returned: false)

    if borrowing
      borrowing.update(returned: true)
      @book.update(available: true)
---
SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = $1 AND "borrowings"."book_id" = $2 AND "borrowings"."returned" = $3 LIMIT $4  [["user_id", 2], ["book_id", 1], ["returned", false], ["LIMIT", 1]]
UPDATE "books" SET "available" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["available", true], ["updated_at", "2025-02-14 19:57:50.598944"], ["id", 19]]
UPDATE "borrowings" SET "returned" = $1, "updated_at" = $2 WHERE "borrowings"."id" = $3  [["returned", true], ["updated_at", "2025-02-12 12:49:52.399400"], ["id", 1]]
UPDATE "books" SET "available" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["available", true], ["updated_at", "2025-02-12 12:49:52.426529"], ["id", 1]]

  def current_user
    puts "Session user_id: #{session[:user_id]}" # Debugging
    @current_user ||= User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]