app/controllers/borrowings_controller.rb

SELECT COUNT(*) FROM "borrowings" WHERE "borrowings"."user_id" = $1 AND "borrowings"."returned" = $2  [["user_id", 2], ["returned", false]]
---
  def borrowed_books_count
    count = @current_user.borrowings.where(returned: false).count

SELECT "borrowings".* FROM "borrowings" WHERE "borrowings"."user_id" = ? AND "borrowings"."book_id" = ? AND "borrowings"."returned" = ? LIMIT ?  [["user_id", 3], ["book_id", 13], ["returned", 0], ["LIMIT", 1]]
---
  def borrowing_status
    borrowing = @current_user.borrowings.find_by(book_id: params[:id], returned: false)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
  def set_book
    @book = Book.find_by(id: params[:book_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def authorize_request
    header = request.headers['Authorization']
    token = header.split(' ').last if header

    begin
      decoded = JsonWebToken.decode(token)
      @current_user = User.find_by(id: decoded[:user_id])