app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["username", nil], ["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2025-02-14 22:11:40.887399"], ["updated_at", "2025-02-14 22:11:40.887399"], ["name", "kim"]]
---
    def create
      user = User.new(user_params)

      if user.save